'''Дан целочисленный список A размера 10. Вывести порядковый номер последнего из
тех его элементов AK, которые удовлетворяют двойному неравенству A1 < AK < A10.
Если таких элементов нет, то вывести 0.'''
def index(A):
    # Получаем значения A1 и A10
    A1 = A[0]
    A10 = A[9]
    
    # Инициализируем переменную для хранения индекса последнего подходящего элемента
    last = 0
    
    # Проходим по всем элементам списка
    for i in range(1, 9):  # Индексы от 1 до 8 (включительно)
        if A1 < A[i] < A10:
            last = i + 1  # +1, чтобы получить порядковый номер (1-индексация)
    
    return last

def main():
    # Пример списка A размера 10
    A = [5, 7, 10, 12, 3, 8, 15, 6, 9, 20]
    
    # Находим порядковый номер последнего подходящего элемента
    result = index(A)
    
    # Выводим результат
    print(result)

main()
